{"review_text": "I'm realy enjoying using this app. I literally can find any song I want. It's just AMAZING! I stay up-to-date about latest releases, I can keep track of viral songs in different countries and most importantly I can access to the BEST PLAYLISTS EVER made by Spotify Community. If you're thinkin' on installing it, well... don't hesitate cause you're about to dive into millions of songs with highest quality. I hope you'll enjoy it too like I've been for 4 years.", "review_rating": 5, "review_likes": 9732, "author_app_version": "8.5.5.853", "review_timestamp": "2019-05-13 15:15:13"}
{"review_text": "Spotify is a great app to listen to music and podcasts. You can find almost any song here. Spotify regular is not as good though. I remember how many ads there were. Spotify premium is way better. It gives great suggestions and helps discover new songs. Over the past year, I've had to travel a lot in the car and Spotify has got me through those long car journeys.", "review_rating": 5, "review_likes": 6244, "author_app_version": "8.8.22.510", "review_timestamp": "2023-04-02 16:16:10"}
{"review_text": "i have over 170 songs on only one of my playlists! and you can make many playlists, and find any songs you want! if apps could tell you how many hours you have spent on an app, i would probably have about 100+. Premium is the best to have while using this app. if yiu dont want to spend $10 a month on an app, then you could use the free version, which is the one you use when you first download the app. I use premium though. which is worth it 100 percent, every pennie! Like music? then download!", "review_rating": 5, "review_likes": 6235, "author_app_version": "8.5.1.734", "review_timestamp": "2019-04-13 14:38:04"}
{"review_text": "The best music streaming app ever!!! I'm using it since its launch and it's just gone better and better. The best part is the Wrapped mode we get at the end of each year wrapping all the songs and telling us about the top 5s of each category. Just one issue, please allow individual song download. It's hectic putting all the songs in a playlist first and then downloading it.", "review_rating": 5, "review_likes": 4274, "author_app_version": "8.7.90.544", "review_timestamp": "2022-12-07 18:00:17"}
{"review_text": "I have used almost every music provider except apple's music. So, I can say that the differences in audio quality are barely noticeable but the usability differs. For example, here in Spotify, you can stream music from one place to different devices, can add sleep timers, recommendations are better than the competition and, the number of content is huge, added to that there is a windows app that works seamlessly. App experiences are good, if it gets any bugs; it gets fixed in the next update.", "review_rating": 5, "review_likes": 4119, "author_app_version": "8.7.30.1221", "review_timestamp": "2022-05-15 04:52:02"}
{"review_text": "Spotify is the best music streaming app, very easy to use.", "review_rating": 5, "review_likes": 3967, "author_app_version": "8.4.96.953", "review_timestamp": "2019-03-08 14:17:44"}
{"review_text": "Probably the best music streaming app I ever used till now. It has so many features like - 1. You can make blends with your friends. Spotify can create a blend for 10 people ( that's a lot ) 2. To be honest, the ads are never too much, unlike some other apps where you get an ad after every 1 song. 3. It can play music in the background. 4. It also automatically starts a song if the song which you chose to play is done playing. Conclusion : I highly recommend this app", "review_rating": 5, "review_likes": 3523, "author_app_version": "8.7.44.968", "review_timestamp": "2022-07-04 19:06:27"}
{"review_text": "This is a pretty good app for music 🎶🎵and podcasts. I also want to add that the people who are saying that the ads in the app are annoying must be misunderstanding something, as Spotify has a very limited amount of ads. The app is giving much more while its free(Of course it earns by advertising💵💵). And you can purchase premium(at a very low cost) if you hate ads. Thank you for reading my review. 😀😀 Still my fav:D", "review_rating": 5, "review_likes": 3382, "author_app_version": "8.7.62.398", "review_timestamp": "2022-09-22 20:47:48"}
{"review_text": "We use this app in our church so that we can easily find those worship songs that we will line up for our Sunday services, Youth services, C2P and more. The premium helps us a lot because we can easily pick and download the songs, we can listen to it and practice anytime, anywhere.", "review_rating": 5, "review_likes": 3207, "author_app_version": "8.5.3.716", "review_timestamp": "2019-04-30 11:07:49"}
{"review_text": "I've been using Spotify for years now, and I can honestly say that it's the best music streaming app out there. It has a massive library of music, from all genres and eras. The playlists are well-curated, and the algorithm for music discovery is excellent. I've discovered so many new artists and songs thanks to Spotify. The interface is clean and easy to use, and it's available on all major platforms. Whether you're listening on your phone, computer, or smart speaker, Spotify just works.🤩❤️", "review_rating": 5, "review_likes": 2861, "author_app_version": "8.8.54.481", "review_timestamp": "2023-07-25 04:35:14"}
{"review_text": "This has been my source of music for 8 years now, and I've been a premium member the whole time. Money well spent, in my opinion. I work out of cell range quite often and being able to download my playlists has been amazing. I love every feature spotify has, from my daily mix playlists to showing me my top songs from the year prior. Seriously, not a day goes by where I don't listen to music so having an app this great is a necessity. I couldn't recommend this app more highly. Keep it up, Spotify", "review_rating": 5, "review_likes": 2728, "author_app_version": "8.4.97.807", "review_timestamp": "2019-03-23 02:02:05"}
{"review_text": "Never once had a problem I simply love the design and accessibility of spotify, the price might be a tad steep but its definitely worth it. Through what i've been seeing in the reviews, I think there should be an option to change an interface (for ex. one for older, slower electronics that uses less RAM or processing power and another with a new look for the newer and faster phones that can handle a heavy load that both options are updated with any new features)", "review_rating": 5, "review_likes": 2432, "author_app_version": "8.5.13.637", "review_timestamp": "2019-07-08 18:37:26"}
{"review_text": "I've been using Spotify for about 2 years and it's honestly the best music app out there. It's very feature rich. My favorite feature has got to be how every device is synchronized when you're logged in, you can be using Spotify on your computer and control it with your phone. Spotify also has a great way to discover new music in their Browse feature. Their radio feature is not as good as Pandora or Google Play Music but it's not something that kills the experience. I am a premium member and I'm very happy.", "review_rating": 5, "review_likes": 2352, "author_app_version": "4.5.0.820", "review_timestamp": "2016-01-25 16:33:48"}
{"review_text": "perfect", "review_rating": 5, "review_likes": 2341, "author_app_version": "8.4.98.843", "review_timestamp": "2019-04-08 00:43:04"}
{"review_text": "Been waiting for the update with lyrics on phone for quite a while but I still don't see them even though I have Premium. I have clean uninstalled and reinstalled the newest version multiple times, logged out back in twice as suggested in forums but no luck. It works on all my friends Android devices. Desktop version shows them for me. Unfinished/broken features on paid subscriptions is a big red flag for me. Gonna drop the rating to 1 star till fixed.", "review_rating": 5, "review_likes": 2332, "author_app_version": "8.8.76.667", "review_timestamp": "2023-10-16 11:28:04"}
{"review_text": "The app is amazing and gives so many vast range options to choose from, both music and podcasts. I really like listening on this platform and the Spotify wrap is simply amazing!! I am always for the year end to see mine. The only issue is that it doesn't give you option to download a single song. You can only download a playlist and as soon as you add a new song to that playlist it automatically starts to download that song which is annoying because it aquires unnecessary space in your phone.", "review_rating": 5, "review_likes": 2330, "author_app_version": "8.8.4.518", "review_timestamp": "2023-02-03 13:59:12"}
{"review_text": "The new layout sucks. 'Liking' a song to save to the library is bad. Moving the three dot options to the top right, where the queue used to be, is stupid. If you were to keep this new layout, at least put the queue back to the top right, and the three dot options to the bottom right OR back next to the song title where it used to be. This isn't the first time you've messed up a perfectly good layout either. Stop trying to fix things that aren't broken. 1 star until you sort your stuff out.", "review_rating": 5, "review_likes": 2284, "author_app_version": "8.5.73.824", "review_timestamp": "2020-09-04 17:07:52"}
{"review_text": "i really like Spotify, i have built a library of almost all my cd's and then some. love to be able to create playlists. and the \"auto play feature\" plays similar music to what i was listening to. i have found some really great music from that feature. and i check my artists albums & many times a new album comes up. love it listen at least 1/2 day, everyday. thanks Spotify... great stuff!!!", "review_rating": 5, "review_likes": 2266, "author_app_version": "8.5.6.673", "review_timestamp": "2019-05-17 23:54:44"}
{"review_text": "It's easily the best app out there for streaming music. But, there is an issue I noticed. When I go to more info about a song with multiple artists, and I click on artists, it just keeps loading in the submenu without opening up to it. Faced this issue with 2 Android phones in the past one month.", "review_rating": 5, "review_likes": 2141, "author_app_version": "8.7.68.568", "review_timestamp": "2022-09-29 12:20:29"}
{"review_text": "I love spotify because it recommends music to you based on your listening habits and preferences. It has helped me to find some awesome artists because most musicians have similar artists that you personally are not aware of, but with the help of spotify you will find them and love them because they are quite similar to music that you already like but at the same time a little bit different and fresh. Its especially great with friends because you can create collaborative playlists.", "review_rating": 5, "review_likes": 2105, "author_app_version": "8.5.5.193", "review_timestamp": "2019-06-06 10:58:36"}
{"review_text": "The app is very good. I got to explore many new songs. However, I took out a star because of a few reasons. First:- It sometimes lags and won't show the music dialog box on your screen or in the app and for this I have to restart it. Second:- I cannot delete my history on phone. Third:- Sometimes the song stops and doesn't start radio", "review_rating": 4, "review_likes": 8161, "author_app_version": "8.8.68.565", "review_timestamp": "2023-09-22 07:18:36"}
{"review_text": "Everything is really great with this app except for 2 issues. First, it seems as though Spotify doesn't make a lot of podcasts available that seem to be available on other podcast providers. Secondly, when you are searching for podcasts, and you find one you really like, there needs to be a section that shows you \"similar podcasts\" so I can discover more of them.", "review_rating": 4, "review_likes": 5478, "author_app_version": "8.5.16.781", "review_timestamp": "2019-07-27 11:36:02"}
{"review_text": "Edit: Recent update removed the ability to sort songs from oldest to most recent. I mean why remove a perfectly fine feature 😕👎 Otherwise I love 💗 it. I listen to various songs that are in different languages and I like that it shows the lyrics in the same language instead of romanizing everything. Just one issue, some of my favourite artists songs are not available on Spotify. Plus, sometimes ads get too annoying to the point that there's an add after each song( though this happens rarely).", "review_rating": 4, "review_likes": 4749, "author_app_version": "8.8.36.521", "review_timestamp": "2023-05-18 02:54:03"}
{"review_text": "2 years of use so far. This is my favorite app to play music. Easy to use. I've found lots of music that I've never heard before; both old and new. My play lists just get longer and longer. I don't recall searching for any song I wanted and not finding it. I did notice lately, music sometimes pauses. Also, control bar goes away when I leave my car and come back. Music plays but I have no control. App restart required to get it back. Please fix it. Lost 1 star because of this.", "review_rating": 4, "review_likes": 4738, "author_app_version": "8.7.22.1125", "review_timestamp": "2022-04-20 20:38:00"}
{"review_text": "I don't like subscription based apps. But this one to me is justifiable. Seamless transitions from phone, to pc, to Xbox, to Bluetooth in my vehicle. It rarely has issues and obviously has the widest selection of music. Hands down best way to listen to music or talks.", "review_rating": 4, "review_likes": 4726, "author_app_version": "8.7.92.521", "review_timestamp": "2022-12-30 01:51:21"}
{"review_text": "I Love It But It Has A Problem It Dont Have A Repeat Option Please Add It. But Spotify Has Song That Others Apps Dont Have Thats Why I Like It But Please Add A Repeat Option", "review_rating": 4, "review_likes": 4180, "author_app_version": "8.5.0.37", "review_timestamp": "2019-03-23 18:05:35"}
{"review_text": "Good application and service, although it has rather confusing UI (also on desktop). There is a list of songs being played, but the is also a separate play queue. at different times these have different priority, which means is sometimes hard to play the song you actually want to hear...", "review_rating": 4, "review_likes": 3368, "author_app_version": "8.5.13.637", "review_timestamp": "2019-07-08 09:05:35"}
{"review_text": "Look, I love your app. Adore your student plans. I spend so much time on your services. But. Please add a bulk editing option. I saved an entire album instead of one song by mistake because the album and the song had the exact same name. Unfortunately, the album had a ton of songs so I had to delete each and every one of 35+ songs. Long press to select multiple songs at once would have been perfect. Also, please make it more obvious whether a user is saving an album or a song.", "review_rating": 4, "review_likes": 3320, "author_app_version": "8.4.94.817", "review_timestamp": "2019-02-23 15:32:30"}
{"review_text": "Glad that we get the song lyrics too now ...... but we do need translations for Non English songs, like Kpop and latin songs hope we get translation option too soon 👍🏻", "review_rating": 4, "review_likes": 3159, "author_app_version": "8.5.66.1002", "review_timestamp": "2020-07-22 12:35:13"}
{"review_text": "Personally, I think the app is great. It has tonnes of songs, great podcasts. The main thing I'm upset with is how many limitations there are in the free version. Yes I understand that premium is all cool, you get new things. But I feel like you should be able to pick what song to listen to. It also bothers me how you add /your/ pick of songs onto /our/ play lists. You can suggest a song to us, that's cool. But please don't add it to our play list. Especially if we can't get rid of it. Thanks.", "review_rating": 4, "review_likes": 3035, "author_app_version": "8.7.14.1332", "review_timestamp": "2022-03-22 02:15:00"}
{"review_text": "It's very useful when you have a premium membership! It almost all the songs you can think of (except for some small bands or music in other languages in my experience), and is easy to use. On the other hand, using the app without the membership is not fun. It will play songs that you don't have on your playlists, as well as constant ads that say \"enjoy your 30 minutes of no ads!\" But they play another after a couple of song, and they only allow a couple song skips a day!", "review_rating": 4, "review_likes": 2922, "author_app_version": "8.8.72.630", "review_timestamp": "2023-09-27 04:44:23"}
{"review_text": "It is the best music app you can find... But but but the only problem is the the ads are very frequent and are too long and annoying. It says that you will get 30 minutes of uninterrupted music but after 10 minutes another ad will show up. You can buy premium but everyone can't do that, that's the only reason I am giving it four stars, the ad are so so annoying. Please solve it.", "review_rating": 4, "review_likes": 2599, "author_app_version": "8.6.98.900", "review_timestamp": "2022-01-25 15:08:59"}
{"review_text": "I've had the app for years now, and I love that I can find all the music as well as podcasts that are part of my daily brain food! Recently (specifically within the last few months) the app keeps pausing on its own mid play. Doesn't matter what I'm listening to, if I have the screen up or not, it just pauses. It also has stopped displaying the currently playing option, so I'll have to manually go find whatever I have been playing to start it again. If this could be fixed, i would go 5 stars!", "review_rating": 4, "review_likes": 2544, "author_app_version": "8.7.20.1261", "review_timestamp": "2022-04-13 01:04:37"}
{"review_text": "Ha mejorado", "review_rating": 4, "review_likes": 2474, "author_app_version": "8.5.20.857", "review_timestamp": "2019-08-30 02:05:10"}
{"review_text": "I'm going to be honest. This app is great. I always have recommended this app to my friends for better quality of music. But I am very disappointed that even with premium subscription some songs are unplayable. And when I searched why, the Spotify community services did not give a clear explanation as to how to solve my problem. I found some songs that were unplayable and showed \"you have discovered a premium feature\". So upgraded to premium and still those songs are unplayable.", "review_rating": 4, "review_likes": 2403, "author_app_version": "8.7.8.1206", "review_timestamp": "2022-03-02 09:13:08"}
{"review_text": "I don't have any complaints over the app but, I've got a suggestion if you can consider. I was just thinking, if there would be an option to mute all notifications that could disturb the song. Like a slider near shuffle or repeat option so that the user can listen songs without disturbances. But keeping in mind the importance of the notifications in one's life, this option could be turned off manually or automatically when someone clears the RAM or closes the app.", "review_rating": 4, "review_likes": 2169, "author_app_version": "8.7.36.905", "review_timestamp": "2022-06-07 03:23:28"}
{"review_text": "Great presentation and overall appearance of the application. Recommendations got better. And over more thing needs to be done; to be able to customise the order of the songs in your personal playlist. And ads could be a bit less frequent. But, thank you!", "review_rating": 4, "review_likes": 2120, "author_app_version": "8.8.10.582", "review_timestamp": "2023-02-19 03:27:53"}
{"review_text": "Only giving 4 stars instead of 5 because of the most recent bugs (PLEASE PATCH!!!) I pay for premium + hulu, and although I love every single second of the service, the recent bugs are almost impassable. I close the app, the music keeps playing. I go to reopen the app to find that music is playing, but I can't view the song I'm listening to. So again, I have to restart the app. This happens every time I use different devices. I sell Spotify Premium for y'all. I've been using it for over 10 years", "review_rating": 4, "review_likes": 2119, "author_app_version": "8.7.22.1125", "review_timestamp": "2022-04-16 12:31:49"}
{"review_text": "Stoppage issues. Since the last update, I've had issue with the song playing and then the app going dead. I get the \"song trying to play but won't play\" searching bar. I've uninstalled and reinstalled, but it still happens on occasion. Would love if you could figure out the bug that's causing this and fix it! Love the app, tho. Started paying so I could use it when driving in the mountains. Offline mode options are great!", "review_rating": 4, "review_likes": 2028, "author_app_version": "8.8.46.529", "review_timestamp": "2023-06-28 00:13:53"}
{"review_text": "Great music app, been using it for over 4 years now, but since the latest update, whenever I listen to my liked songs, once the song I've selected is over, it goes back to the top of my liked songs no matter where I am, instead of playing through to the next song. Maybe it's just me that's affected by it, maybe not. Otherwise I love the app.", "review_rating": 4, "review_likes": 2014, "author_app_version": "8.5.51.941", "review_timestamp": "2020-04-08 01:38:16"}
{"review_text": "The app is really incredible and allows you to pick from so many different genres.It also allows you to watch episodes and make your own playlists and has specific topics for you to listen from. The only cons are: *You can't even listen to \"a\" song without upgrading to premium if there is no internet connection. *Even though it says once in 30 minutes there is an ad,it appears once in 10-15 minutes. This app is helpful and motivational....", "review_rating": 3, "review_likes": 4506, "author_app_version": "8.7.22.1125", "review_timestamp": "2022-04-21 14:31:36"}
{"review_text": "Love the collection of songs! Just that there are now so many irrelevant ads. Random ads start playing between a song or two continuously. Despite the message that I will be provided with 30 minutes of uninterrupted music, a new add pops up after 10 minutes. And not only that. Each ad which plays goes on for a minute or a half. It is becoming annoying but I hope that this is solved.", "review_rating": 3, "review_likes": 4293, "author_app_version": "8.8.12.545", "review_timestamp": "2023-02-22 15:46:34"}
{"review_text": "✅An essential music library with nearly all the songs. ♥But they could be better if they allowed one specific feature: downloading option should be shown per song(in the options menu along with \"queue\", \"like\" etc)and not a single button for the whole playlist. I don't want to keep on creating new playlists to selectively download songs. 💔😤😡 And stop supporting the woke culture and encouraging \"pride\" as a good virtue. It's unnatural, sin and more importantly a deadly sin.", "review_rating": 3, "review_likes": 3769, "author_app_version": "8.8.40.470", "review_timestamp": "2023-06-07 15:48:53"}
{"review_text": "I'm trying to access the Canvas feature on Spotify for a while now, but to no avail as the option to access Spotify Canvas doesn't appear under the settings for me. I've updated the app as much as possible, and my Spotify version is listed as version 8.7.52.1010. This is quite disappointing to me, as I had high expectations to use the feature. It'd be greatly appreciated if I was helped with this issue, and if it could be resolved.", "review_rating": 3, "review_likes": 3152, "author_app_version": "8.7.52.1010", "review_timestamp": "2022-08-03 15:36:26"}
{"review_text": "Yes, like all, it's those constant ads. Initially it was 2 ads per 4 or 5 songs, then it was 2 ads per 2 or 3 songs. It was still fine. But now, its 3 ads per 2 or 3 songs and it's frustrating. Not all can afford or would like to take a premium. So kindly look after the ads. Apart from that I'd prefer spotify because it introduced me to different artist with the kind of music I listen to. Also, spotify streams means a lot to an artist's career as well.", "review_rating": 3, "review_likes": 3081, "author_app_version": "8.8.8.548", "review_timestamp": "2023-02-18 14:26:56"}
{"review_text": "Spotify is not only one of the best music apps but also an app that provides a unique listening experience but sadly ever since the latest update was done, the song scroller has disappeared (that helps in moving up and down in a longer than long playlists) and there's no way to get it back, not that I know of. I've tried finding out solutions but couldn't find any. It's a crucial feature that enables listeners in navigating. Bring it back, or provide a better alternative.", "review_rating": 3, "review_likes": 2996, "author_app_version": "8.7.54.403", "review_timestamp": "2022-08-14 13:28:35"}
{"review_text": "I'm facing lot of bugs on my mobile. I subscribed to premium to get the premium experience of Spotify. I tried reinstalling many times. But it doesn't get resolved. I'm changing my rating from 5 to 3. I'm facing these kinda issues recently. 1. When I click clear on recent search, it doesn't clear the list. 2. When I skip the song, sometimes it takes some time to change to next song. And I can't remember some bugs.", "review_rating": 3, "review_likes": 2885, "author_app_version": "8.7.10.1262", "review_timestamp": "2022-03-14 02:55:33"}
{"review_text": "I've been using this app for over a year and it's my go-to music app. However, Lately I've been having an issue. Whenever I log-in with my password, It shows that's it's incorrect and I have to log-in through email everytime by choosing the 'log-in without password' option. I've tried setting new passwords and logging back again but it keeps showing incorrect password. I hope Spotify can resolve this issue as soon as possible. It's a major inconvenience for a regular Spotify user like me.", "review_rating": 3, "review_likes": 2843, "author_app_version": "8.8.58.473", "review_timestamp": "2023-08-15 12:19:53"}
{"review_text": "I enjoy using this app, and I think it's a great option for listening to music/podcasts. However, the amount of ads is beginning to be an issue. I have absolutely no problem with having ads, but the frequency with which ad breaks happen is frustrating. Here lately I can't go more than 2-3 songs before getting another ad break. Again, I'm fine with having ads, but when there's as much time listening to ads as listening to music, if not more, than the app experience becomes terrible", "review_rating": 3, "review_likes": 2722, "author_app_version": "8.7.48.1062", "review_timestamp": "2022-07-29 18:31:24"}
{"review_text": "ever since the latest update, I've also been having the same problems as many other users, Spotify keeps crashing, the song stops playing suddenly,it doesn't show the correct song, the song time goes up far more than the original duration and I can't control the songs from my lockscreen sometimes. I've tried reinstalling but it is still the same", "review_rating": 3, "review_likes": 2655, "author_app_version": "8.5.78.909", "review_timestamp": "2020-10-04 14:00:03"}
{"review_text": "The app was almost perfect before. I just don't understand why they make the app tough to navigate with every update. 1. If i go to the options menu of a song, there is no download option. I have to create a playlist, make that playlist downloadable and then add the song there to download it. Why? 2. Earlier there used to be a downloaded songs section/playlist. It is no longer there. It's just unbelievably inconvenient to navigate. 3. Searching for songs while offline is a nightmare.", "review_rating": 3, "review_likes": 2523, "author_app_version": "8.8.40.470", "review_timestamp": "2023-06-03 11:49:21"}
{"review_text": "It's a great app. I've been a premium customer of Spotify for almost a year now, but I'm suddenly having issues with my player. When I play a song, the music drops a beat and starts to fluctuate and the audio quality and sound drops automatically, even on Wi-Fi. I have set everything on very high settings. Kindly fix this bug.", "review_rating": 3, "review_likes": 2489, "author_app_version": "8.8.12.545", "review_timestamp": "2023-02-28 05:38:24"}
{"review_text": "Spotify was almost the perfect music listening app. It was PERFECT. But the new update just degrades it's performance. Before, Spotify Free offered a lot of features and it was good. But now one can't make a queue, turn off shuffle, play the previous song etc. It's really frustrating. The new update leaves us so frustrated that we'll eventually be compelled to choose the premium version. Spotify team, plz look into this and i hope you'll make suitable changes in the next update.", "review_rating": 3, "review_likes": 2307, "author_app_version": "8.8.44.527", "review_timestamp": "2023-06-22 13:51:48"}
{"review_text": "The song quality, the podcasts and the infinite number of songs is all amazing, but the sometimes the app just stops working on my phone, so I think they should improve the quality and speed of the app itself. Otherwise it's an amazing experience with all your private playlists and millions of songs. I also recommend it, even if my rating is only 3 stars.", "review_rating": 3, "review_likes": 2189, "author_app_version": "8.7.2.1205", "review_timestamp": "2022-02-06 10:40:51"}
{"review_text": "I like the app overall. But my playlists have stopped opening. My wifi connection is great but the playlists just won't open. My liked songs just won't open and it's a big problem. The other playlists of mine and the artists also won't open. I hope you fix it as soon as possible. Because it's causing a huge inconvenience to me.", "review_rating": 3, "review_likes": 2170, "author_app_version": "8.7.48.1062", "review_timestamp": "2022-07-24 10:55:28"}
{"review_text": "I've been using Spotify for a long time and it's worked wonders! But recently, the song stops mid-way for no reason! I check the app and the icon in the bottom to pause and play the song isn't there, then I have to shuffle my playlist again. Another thing is anytime I want to add new songs I can't hear a preview. For me I used to be able to hit loop on songs but now I'm not allowed to anymore (if it was changed to a premium feature I wasn't aware of that, sorry.) Besides that the app is great!", "review_rating": 3, "review_likes": 2053, "author_app_version": "8.7.28.1217", "review_timestamp": "2022-05-07 19:26:38"}
{"review_text": "Spotify works for me, and I don't use premium. I get 6 skips an hour and can only choose a song for half a day. That's ok, but I ran into an error lately, where the app sends me notifications from Podcasts that I don't listen to anymore. I used to follow them, now I don't, but it still sends me notifications for new episodes. Hope it gets fixed soon. But, other than that, the app works fine! Would recommend.", "review_rating": 3, "review_likes": 1944, "author_app_version": "8.8.46.529", "review_timestamp": "2023-06-30 14:15:39"}
{"review_text": "I absolutely love how extensive this app has when it comes to music. There is amazing music and they even have unknown artists that can be discovered. But recently, I was listening to music while I was taking a shower with the free version and I had gotten an ad after every song. It was very annoying, and another thing I have a problem with is when I connect to my alexa, the 30 minute ad free option just doesnt work. It is very confusing and frustrating.", "review_rating": 3, "review_likes": 1811, "author_app_version": "8.8.56.538", "review_timestamp": "2023-07-31 17:14:37"}
{"review_text": "I've been using Spotify for three years now and it has always been great. I don't know if it was the latest update that brought the bug I've been seeing lately. I am able to reproduce anything, however they control bar(pause, next, previous) does not appear within the app or on the notification bar. I am unable to control what's reproduced in any way, not even with earphones in.", "review_rating": 3, "review_likes": 1755, "author_app_version": "8.7.44.968", "review_timestamp": "2022-07-11 16:05:27"}
{"review_text": "Listening is no problem, everything is clear, it's easy to listen to songs, it's good, except for not being able to listen in order unless your on premium. You can only listen to previews of the song, only being able to skip 6 time per hour. This app is better for listening to podcasts than music. Also the ads are getting to be too much. But it's still nice to listen to songs on here. I get songs that I sometimes can't get on other apps.", "review_rating": 3, "review_likes": 1732, "author_app_version": "8.7.56.421", "review_timestamp": "2022-08-16 17:04:12"}
{"review_text": "Curious why I no longer have the option to start a song radio or a playlist radio on mobile. if it's because that feature is only for premium users, that's pretty weak. Also, what happened to 30 minutes of an free music? I went on a 20 minute run, and 70% of it was all commericals. I had 3 separate commercial breaks in that time. not happy, spotify.", "review_rating": 2, "review_likes": 7985, "author_app_version": "8.5.13.637", "review_timestamp": "2019-07-08 22:58:41"}
{"review_text": "I'm a longtime user of Spotify and I love it to death! Sure the small amount of skips, amount of ads, and not being able to listen to my likes/playlists even after I reshuffle after listening to them all can be annoying, but I'm fine with that! My problem, though, is that I can't use this app anymore - when I play my songs or playlists, it'll just crash during it. It's gotten to the point where I can't get through ONE song without it crashing! Really sad about this, hoping it gets fixed soon :D", "review_rating": 2, "review_likes": 6286, "author_app_version": "8.7.20.1261", "review_timestamp": "2022-04-11 22:54:33"}
{"review_text": "Spotify was the best music app ONCE. I don't know what has happened but lately there is this issue of not finding the artist or the song i wish to listen here in India. Seems that the team has tweaked something somewhere that has lead to the loss of the songs one wishes to listen. On demand songs was the major factor for me to go premium. Inspite of having a premium account, the end result is disappointment as i fail to find the song i want. This is ridiculous and needs amendment at the earliest", "review_rating": 2, "review_likes": 4890, "author_app_version": "8.8.22.510", "review_timestamp": "2023-04-07 02:50:19"}
{"review_text": "The promise of skippable ads is not being upheld. While you can skip ads with the app open, you cannot skip them from the lock screen or via the headphones. When playing playlists, will come up with 'song not available' and will stop abruptly, despite being able to play all the songs at different times. Very annoying, especially on a walk with no hands free...", "review_rating": 2, "review_likes": 4817, "author_app_version": "8.5.17.676", "review_timestamp": "2019-08-03 03:39:56"}
{"review_text": "The sound quality is amazing , I've been using the app for some time now. There is a major issue with the network and loading , all other apps (including other music apps) work absolutely fine on my phone with the current network. Except Spotify , it doesn't load at all. After many attempts at restarting the app , it sometimes works well. No problems with any other features though 👍", "review_rating": 2, "review_likes": 4298, "author_app_version": "8.7.36.923", "review_timestamp": "2022-06-12 19:00:21"}
{"review_text": "I've used Spotify for 5 years now, and i honestly really liked the app. It was easy to navigate through. But these new updates where i cant skip a song or play any song of my choice or restart a song without premium has really downgraded the experience. If this goes on im probably going to have switch to another app through which it wouldn't be this annoying to play a song. Thank you for all you've done over the last few years Spotify.", "review_rating": 2, "review_likes": 4206, "author_app_version": "8.8.44.527", "review_timestamp": "2023-06-15 14:38:46"}
{"review_text": "This app has great sound quality and is easy to use. I enjoy it. But I don't like how you have limited skips if you're a free listener and can't pick what song to play, the entire playlist just goes. I also don't like how the playlist automatically shuffles. What if you don't want it shuffled? Other than these issues and some pretty annoying but bearable ads, the app is great and I would recommend it.", "review_rating": 2, "review_likes": 3476, "author_app_version": "8.7.38.665", "review_timestamp": "2022-06-20 23:31:44"}
{"review_text": "Spotify is such an amazing app. I have been using it since 5 years. Although I never brought the premium, yet it worked great for me. However, now it's not working the way it use to do before. I cannot put songs on loop, i cannot replay same song, i cannot rewind it, which is frustating. I really dont want to uninstall this app. But i think i dont have any other option to fix it. If u still can fix it, please do it ASAP.", "review_rating": 2, "review_likes": 2826, "author_app_version": "8.8.48.523", "review_timestamp": "2023-07-01 05:12:15"}
{"review_text": "Great app, been using it for a while. The main thing I have an issue with, are the ads. They are literally unbearable now. It totally ruins the mood and ambience and shows another ad after the 'watch this video to get 30 minutes of uninterrupted listening'. Ridiculous ! Anyways, would be amazing if Spotify could go a little easy on the advertisements. Edit: the updated free version absolutely sucks now. It was fine at first, but no replaying the same song ? No thank you.", "review_rating": 2, "review_likes": 2718, "author_app_version": "8.8.76.667", "review_timestamp": "2023-10-12 11:28:02"}
{"review_text": "Good overall. Desperately needs gestures to swipe down out of a view such as now playing. Back arrows at the top are old school and not practical for large phones! Tell your customers what you did when you update the app. We should not have to guess. 🙄 Be proud of your work and have an in-app change log or updates on the play store.", "review_rating": 2, "review_likes": 2561, "author_app_version": "8.8.6.472", "review_timestamp": "2023-02-03 20:54:42"}
{"review_text": "I've been using the app since 2018, and it has always worked great. I upgraded eventually to the paid version to get rid of ads, and as of recently, it has been so weird. It stops playing music after 1 song, even if there's more on the queue. The song bar dissappears, and I have to restart the app. Sometimes, that doesn't work either, though. Whatever bug this is, needs to get fixed. It's a very distracting error, especially when I'm driving, and the app just stops playing for no reason.", "review_rating": 2, "review_likes": 2520, "author_app_version": "8.7.90.544", "review_timestamp": "2022-12-14 15:08:31"}
{"review_text": "I have been using Spotify for almost as long as I have had my phone. Good selection of music and audio quality. After the latest update, playlists no longer load. Can't get audio other than previews. The app has always had bugs such as trying to start at times when it isn't open, overriding other apps, but those were minor. Not being able to use the app defeats the purpose. I rated 2 instead of 1 star to benefit past performance. Please, fix the bugs.", "review_rating": 2, "review_likes": 2134, "author_app_version": "8.7.54.403", "review_timestamp": "2022-08-14 18:35:43"}
{"review_text": "Wow, the app's gone downhill recently. I regularly use it to control what music is playing on connected devices, usually my desktop or the system at work. But it's been giving me a lot of issues now. I randomly can't edit the queue, the song displayed on the app won't be the one playing currently, pausing/skipping/etc. won't work. It's really frustrating.", "review_rating": 2, "review_likes": 2015, "author_app_version": "8.8.32.508", "review_timestamp": "2023-05-11 16:09:07"}
{"review_text": "I have always used the free service. I don't mind some ads. Spotify has more recently got to the point where you have to listen to (3) 30 second ads after each and every song. I am pretty sure it has been 4 at times. This is when I'm driving and connected to my truck. The ads are the same horrible ads over and over. I'm switching and using something else. It's too bad. I really enjoyed their playlists, complete artist collections, and many other features.", "review_rating": 2, "review_likes": 1996, "author_app_version": "8.7.88.496", "review_timestamp": "2022-12-08 15:59:18"}
{"review_text": "For a while, I really enjoyed this app and used it almost daily. In the last few months, so many issues have come up, that I'd rather use YT. The music glitches and will skip in the middle of a song, the app will stop working if my screen goes dark, and I will get 6+ ads at a time. I end up listening to more ads than music/podcasts and it is a general hot mess. This is so disappointing. Spotify, please fix this. I don't know what happened but I want the old version back. Please fix the bugs.", "review_rating": 2, "review_likes": 1849, "author_app_version": "8.7.64.478", "review_timestamp": "2022-09-11 06:51:49"}
{"review_text": "I was using the free version spotify for some time, seeing all the good features it offers in the premium version, i upgraded my subscription last year. Turns out Spotify Premium does not have the Canvas feature here in India, Which i think is one of the best in the app. I posted about this issue in the online spotify community in the 'Ideas' Section but still no update is being made or communicated. Certainly the premium version is no use when you can't access the best features.", "review_rating": 2, "review_likes": 1824, "author_app_version": "8.7.14.1332", "review_timestamp": "2022-03-21 15:41:41"}
{"review_text": "This was an easy application to use, to be able to queue up music, choose the individual songs, various sorting options, etc. I'm not sure what they've done with the latest update but it's horrible!! You're no longer able to queue songs, no longer able to choose individual songs, no longer able to do various sorting options. The list goes on of all the things that have been disabled now, that used to make the site so easy and enjoyable to use. There seem to be more advertisements also. 👎💩😔", "review_rating": 2, "review_likes": 1775, "author_app_version": "8.7.84.382", "review_timestamp": "2022-11-22 20:55:40"}
{"review_text": "Ok, so I started using this app in 2020 to listen music and trust me this app was so good. It has many playlists and it wasn't necessary to get premium. But, it's 2023 now and you can't even change a song without turning off shuffle play and you can only turn it off if you have premium. You can't skip to a certain part of a song without premium and just don't get me started on the ads. I mean what good is a music app if you can't do anything without premium? A 2 star experience for me in 2023.", "review_rating": 2, "review_likes": 1765, "author_app_version": "8.8.70.532", "review_timestamp": "2023-09-17 11:05:32"}
{"review_text": "This has become problematic. I thought it was my phone but to read the other reviews who are having the same issue. I hate paying for something I can't use and I love spotify. It stops, it locks, it freezes, sometimes has no clue what episode or podcast it's playing. I've restarted my phone, updated the app, removed the app. Still problematic. I really do hope this gets resolved soon and I'm hoping the complaints are being seen. Thanks.", "review_rating": 2, "review_likes": 1662, "author_app_version": "8.6.30.889", "review_timestamp": "2021-05-27 16:38:26"}
{"review_text": "Buggy app that crashes immediately, even after reimstalling and deleting the cache. I can't cancel my account without logging in and there is no way to contact Spotify. No answers on their help system, but plenty of complaints in the community - since at least 2012. \"We're always making improvements\" they say but it looks like they lack the competence to get the basics right.", "review_rating": 2, "review_likes": 1628, "author_app_version": "8.5.1.734", "review_timestamp": "2019-04-13 11:20:19"}
{"review_text": "From the past week, the songs have been abruptly cut, and there's no problem in connection. it is the same issue with downloaded songs and while using offline mode. Don't know the reason why it's happening, and i have checked with many Bluetooth devices so not issue with Bluetooth and even if I listened in my phone it's the same thing, either the song will be paused and be at 0:02 or the entire queue is vanished. Thought the recent update would correct it, but it further increased it.", "review_rating": 1, "review_likes": 13824, "author_app_version": "8.8.78.587", "review_timestamp": "2023-10-19 04:18:43"}
{"review_text": "I just want to say that the new feature wherein we would have to upgrade to premium JUST to play a song without the shuffle play is really frustrating; it seems that the loop feature is no longer available and that's really disappointing. Moreover, we can only CHOOSE to play songs upto a certain limit per day. I think that the ratings going down is well deserved. Uninstalling. 👎🏻👎🏻👎🏻", "review_rating": 1, "review_likes": 12765, "author_app_version": "8.8.66.563", "review_timestamp": "2023-09-03 17:24:07"}
{"review_text": "This app was my favourite music app. I just loved it. But after the recent update: I can't see the short song videos that used to play with most of the songs. Even the lyrics...why the hell do we have to pay for premium just to read the lyrics?! Recently, there was a feature that translated the lyrics of other languages to English, making it easier to understand the songs. But everything's gone to premium now. I'd change the rating if the old Spotify will return. Not all of us can go", "review_rating": 1, "review_likes": 11894, "author_app_version": "8.8.70.532", "review_timestamp": "2023-09-24 11:09:37"}
{"review_text": "This app was the best music listening app. You could listen to songs without any problem even if you didn't have a premium. But recently I am facing an issue. Whenever I play any song,it plays but the lyrics are never shown for any of them. If this wasn't a big issue I would rate it 3,but I really don't like it. I tried updating but nothing worked,I even reinstalled after deleting it. I hope the team will take notice of this and work on it.", "review_rating": 1, "review_likes": 10507, "author_app_version": "8.8.70.532", "review_timestamp": "2023-09-20 12:03:55"}
{"review_text": "Since the last update unless my phone is unlocked I can't listen to my music. Considering I only use it connected to Bluetooth and while not using my phone I'm not impressed. I've unistalled it, reinstalled, signed out, reset settings and it's still happening. Considering I am paying for this app as well. Looking at the other reviews, I'm not the only one it's happening to. I want compensation and I want answers on when this will be fixed!", "review_rating": 1, "review_likes": 9796, "author_app_version": "8.5.4.770", "review_timestamp": "2019-05-07 01:51:48"}
{"review_text": "The new UI is terrible. Removed the all songs tab. You have to specifically \"follow\" artists for them to get put in to your library and sorted in alphabetical order. Otherwise they're just shown as \"recommended artists\" in random order. You can no longer easily save partial albums. The only way to get an album to show up in your library is to hit save which adds the whole thing. This is a complete step backwards and likely to cause people to switch services. What the hell, Spotify", "review_rating": 1, "review_likes": 9783, "author_app_version": "8.5.7.999", "review_timestamp": "2019-05-24 17:39:47"}
{"review_text": "The latest update was worst. Whoever came up with the idea to limit the skips of songs and to remove the ability to go back to a particular time of the song and also remove the going back to the previous song skip button, I hope you get fired soon 🙂. Atleast they brought back the lyrics of the song. I don't use this app much after the update and I have already switched to Wynk music 🎵 for playing a song on repeat. You guys can go on with this madness.", "review_rating": 1, "review_likes": 9642, "author_app_version": "8.8.76.667", "review_timestamp": "2023-10-11 04:58:19"}
{"review_text": "La app me ha sacado de todos mis dispositivos y no permite iniciar sesion, tampoco sirve el sistema de ayuda y no encuentro una solucion. De que sirve llevar años pagando una suscripcion, si cuando se les da la gana, suben actualizaciones culeras, eliminan la musica cuando se les hincha en gana y ahora ni entrar a mi sesion me lo permiten. Creo que cambiare de app. Y eso que no hable de las subidas de precio...", "review_rating": 1, "review_likes": 7927, "author_app_version": "8.7.8.1206", "review_timestamp": "2022-03-08 18:25:59"}
{"review_text": "I've been using Spotify for 4 years. There was no ads when it was first launched in india. The ads are understandable but it became worse every year. I used Spotify because it easy to use and the amount of songs I was able to listen to. The new updates are terrible I can't even select the songs I want. No queue. The shuffle is so random. So dissapointed by these updates 😕😕😒", "review_rating": 1, "review_likes": 6740, "author_app_version": "8.8.80.599", "review_timestamp": "2023-10-28 09:19:01"}
{"review_text": "The recent updates of the app have become very disappointing, can't search for a song and then play it, neither can skip songs anymore, or play a specific part or rewind a song. This has honestly brought down the entire experience of the app to a point where you literally can't do anything on it except listen to random playlists!!!!! At this rate, the free version of Spotify is a waste!!", "review_rating": 1, "review_likes": 6539, "author_app_version": "8.8.80.599", "review_timestamp": "2023-10-27 16:41:11"}
{"review_text": "This app was working great and I loved this app so much as I can listen to any song without any delay...But now it's so irritating and frustrating that whenever I click on any of the songs in my recent searches it shows that \"this song is not available\". And also when I search songs to listen the song doesn't occur and it seems like it has been deleted from Spotify...And the ads are such a waste of time like I am listening to more adds than music. Please fix these bugs as soon as possible.", "review_rating": 1, "review_likes": 6336, "author_app_version": "8.8.22.510", "review_timestamp": "2023-04-04 05:21:49"}
{"review_text": "Very disappointed with the latest update. It has removed all the basic features like shuffle mode, loop mode, has locked the lyrics for free users and doesn't allow you to play a particular part of the song, you can only listen from the beginning to the end. Also, you can only choose to play a few songs a day! There's even a limit to skipping to the next song. Like seriously for real?? They are basically forcing us to get premium or deal with the horrible user experience. Such a bad app👎", "review_rating": 1, "review_likes": 6313, "author_app_version": "8.8.74.652", "review_timestamp": "2023-10-01 15:18:04"}
{"review_text": "the new update and this only happening to Indian users, afaik, is so disappointing. and right around the time of spotify wrapped too. even if these awful changes are undone now, idk if I'll reinstall spotify", "review_rating": 1, "review_likes": 6107, "author_app_version": "8.8.76.667", "review_timestamp": "2023-10-27 18:08:16"}
{"review_text": "Forever glitchy. App play button and current song playing disappears and i have to constantly restart the app. This app has a great track record of poor updates.", "review_rating": 1, "review_likes": 6000, "author_app_version": "8.7.20.1261", "review_timestamp": "2022-04-12 18:27:39"}
{"review_text": "You are literally forcing people to buy premium subscription, like why would anyone make lyrics a premium features, Spotify thinks they are apple music, this is the worst app you can think of, never using this garbage again", "review_rating": 1, "review_likes": 5910, "author_app_version": "8.8.66.563", "review_timestamp": "2023-09-04 16:14:45"}
{"review_text": "The latest update removes the ability to view your saved music by artist. You can only view your music if you have saved the full album, or created a playlist. Now i have a \"liked music\" playlist with over 5,000 songs in a random order. Who on earth thought it was a good idea to take away a fundamental function for no apparent reason? This has forced me to cancel my premium subscription and look for another app", "review_rating": 1, "review_likes": 5604, "author_app_version": "8.4.97.807", "review_timestamp": "2019-03-16 11:51:27"}
{"review_text": "I used to love Spotify but the new update is not it. I can't add song's to queue,no play next option anymore,can't play a full playlist (after one or two songs it skips to recommended/suggested songs when I really don't want to listen to them. I wanna play my curated playlist!!), I can't turn off shuffle anymore(That was one of the best features but it's now only available in premium), can't pause, rewind, loop. Honestly I'm so fed up with Spotify. I have to look at other streaming options now.", "review_rating": 1, "review_likes": 5195, "author_app_version": "8.8.48.523", "review_timestamp": "2023-06-30 07:00:21"}
{"review_text": "I don't have words to describe my pathetic performance accurately. This app has gotten worse than ever with the new update . You can not skip to any part of the song. No lyrics available. You can't even play your favourite songs .", "review_rating": 1, "review_likes": 4836, "author_app_version": "8.8.64.554", "review_timestamp": "2023-10-30 10:10:11"}
{"review_text": "Editing my review after 3 years: They have made it mandatory to purchase a premium subscription to skip to your favorite part of a song, and you can't replay it while playing. These are basic features of a music app, but now you have to pay for them. So bad. Free music with ads is still tolerable and understandable, but this stunt is so cheap. I have been using Spotify for about 3 years and considered it the finest music app. But no, it's absolutely disgusting now. Uninstalling it on the way.", "review_rating": 1, "review_likes": 4642, "author_app_version": "8.8.78.587", "review_timestamp": "2023-10-23 12:08:07"}
{"review_text": "I use to LOVE Spotify. Paid for premium for years and use it daily. but for the last month now without missing a day, it will just stop playing mid song. its not being used elsewhere, I'm not using my phone and it is random as to when it will do it during my listening session. could be 2 songs in or 6 songs in or do it every single song in a row. doesnt matter if the playlist is saved to my phone, through my google home, in my car or on the web version on my laptop. it's beyond frustrating.", "review_rating": 1, "review_likes": 4219, "author_app_version": "8.5.6.673", "review_timestamp": "2019-05-17 21:03:08"}
